## Cleaning up data files before joining

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
from matplotlib import pyplot as plt

%matplotlib inline

In [7]:
aisles = pd.read_csv('../data/aisles.csv')
departments = pd.read_csv('../data/departments.csv')
order_products_prior = pd.read_csv('../data/order_products__prior.csv')
order_products_train = pd.read_csv('../data/order_products__train.csv')
orders = pd.read_csv('../data/orders.csv')
products = pd.read_csv('../data/products.csv')

In [23]:
aisles.head()

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [24]:
orders.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [30]:
departments.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [32]:
order_products_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [34]:
order_products_train.head()

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [35]:
products.head()

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

#### Data Explanations
The orders table houses transaction-level data

In [28]:
orders.dtypes

[order_id                    int64
 user_id                     int64
 eval_set                   object
 order_number                int64
 order_dow                   int64
 order_hour_of_day           int64
 days_since_prior_order    float64
 dtype: object]

In [29]:
orders.info

[<bound method DataFrame.info of          order_id  user_id eval_set  order_number  order_dow  \
 0         2539329        1    prior             1          2
 1         2398795        1    prior             2          3
 2          473747        1    prior             3          3
 3         2254736        1    prior             4          4
 4          431534        1    prior             5          4
 ...           ...      ...      ...           ...        ...
 3421078   2266710   206209    prior            10          5
 3421079   1854736   206209    prior            11          4
 3421080    626363   206209    prior            12          1
 3421081   2977660   206209    prior            13          1
 3421082    272231   206209    train            14          6

          order_hour_of_day  days_since_prior_order
 0                        8                     NaN
 1                        7                    15.0
 2                       12                    21.0
 3                        7                    29.0
 4                       15                    28.0
 ...                    ...                     ...
 3421078                 18                    29.0
 3421079                 10                    30.0
 3421080                 12                    18.0
 3421081                 12                     7.0
 3421082                 14                    30.0

 [3421083 rows x 7 columns]>]